{
    "sylabus":  {
                    "uczelnia":  "Polsko-Japonska Akademia Technik Komputerowych Filia w Gdansku",
                    "jednostka":  "Filia w Gdansku",
                    "kierunek":  "INFORMATYKA",
                    "profil":  "praktyczny",
                    "tryb_studiow":  "stacjonarny",
                    "wersja_z_dnia":  "19.02.2026",
                    "nazwa_przedmiotu":  "Zarządzanie własnym przedsięwzięciem",
                    "kod_przedmiotu":  "POZ",
                    "rok_studiow":  null,
                    "semestr_studiow":  3,
                    "obligatoryjny":  false,
                    "forma_i_liczba_godzin_zajec":  {
                                                        "wyklady":  15,
                                                        "cwiczenia_lektorat_seminarium":  15,
                                                        "laboratorium_projekt":  null
                                                    },
                    "odpowiedzialny_za_przedmiot":  "dr Albert Śledzianowski",
                    "ects":  2,
                    "godziny":  {
                                    "z_udzialem_prowadzacego_h":  30,
                                    "praca_wlasna_studenta_h":  20,
                                    "calkowita_liczba_godzin_h":  50
                                },
                    "metody_dydaktyczne":  {

                                           },
                    "zaliczenie":  {
                                       "Ćwiczenia":  {
                                                         "sposob":  "Zaliczenie z oceną"
                                                     },
                                       "Wykład":  {
                                                      "sposob":  "Nieoceniany"
                                                  }
                                   },
                    "kryteria_oceny":  [
                                           "Prezentacja multimedialna",
                                           "Analiza przypadków",
                                           "Kryteria oceny",
                                           "Ćwiczenia/Laboratorium/Projekt/Lektorat",
                                           "Punkty gromadzone za pracę na ćwiczeniach i wykład (kolokwium)",
                                           "Ustalenie oceny na podstawie liczby punktów.",
                                           "Punkty gromadzone za pracę na ćwiczeniach 70%",
                                           "Punkty z kolokwium z treści wykładu 30%",
                                           "Przedmiot zalicza 50%+1 punkt",
                                           "brak."
                                       ],
                    "przedmioty_wprowadzajace":  [
                                                     {
                                                         "nazwa":  "brak",
                                                         "wymagania":  "brak"
                                                     }
                                                 ],
                    "cel_dydaktyczny":  "Celem przedmiotu jest omówienie podstawowych kwestii ekonomicznych: gospodarka, system ekonomiczny i społeczny; pieniądz i rynek; uwarunkowania technologiczne, etyczne i prawne; gospodarka oparta na informacji i na wiedzy; marketing; podstawy rachunkowości; formy prowadzenia działalności gospodarczej; zakładanie i zarządzanie firmą",
                    "literatura":  {
                                       "podstawowa":  {
                                                          "pozycje":  [
                                                                          "\"Mikroekonomia\" - David Begg, Rudiger Dornbusch, Stanley Fischer, PWE (2014)"
                                                                      ]
                                                      },
                                       "uzupelniajaca":  {
                                                             "pozycje":  [
                                                                             "1. „Banki i rynki finansowe. Od zaufania publicznego do kasyna” - Zbyszek Grocholski",
                                                                             "2. \"Wolny wybór\" – Milton Friedman",
                                                                             "3. „Mapa i terytorium” - Alan Greenspan",
                                                                             "4. “Kapitał XXI wieku” – Thomas Piketty",
                                                                             "5. „Makro i mikroekonimia” – Wydawnictwo PWN"
                                                                         ]
                                                         }
                                   },
                    "efekty_ksztalcenia":  {
                                               "wiedza":  [
                                                              "Student zna i rozumie w jaki sposób zaplanować przedsięwzięcie informatyczne. Zna sposób wstępnej oceny ekonomicznej, aspektów społecznych oraz analizy wykonalności przedsięwzięcia.",
                                                              "Student zna i rozumie podstawowe problemów etycznych, społecznych i zawodowych informatyki oraz odpowiedzialności związanej z działalnością",
                                                              "w obszarze informatyki; ma podstawową wiedzę w zakresie ochrony własności intelektualnej oraz prawa patentowego i autorskiego.",
                                                              "Student zna i rozumie zasady prowadzenia działalności",
                                                              "gospodarczej, szczególnie przedsięwzięć. Zna ogólne zasady tworzenia przedsiębiorczości, szczególnie w zakresie zastosowań rozwiązań informatycznych"
                                                          ],
                                               "umiejetnosci":  "Student potrafi przeanalizować projekt informatyczny pod względem wpływu na otoczenie oraz jego opłacalności.",
                                               "kompetencje_spoleczne":  [
                                                                             "Student jest gotów do podejmowania starania, aby przekazać informacje i opinie w sposób powszechnie zrozumiały",
                                                                             "Student jest gotów do działania w sposób przedsiębiorczy."
                                                                         ]
                                           },
                    "tresci_programowe":  [
                                              "Pojęcia podstawowe: rynek, popyt i podaż.Nowoczesny system ekonomiczny ispołeczny. Ekonomia, technologia i etyka.",
                                              "Rynek, Konkurencja. Wartość i powstawanieceny. Pieniądz. Pieniądz w świecie IT.",
                                              "Państwo a gospodarka. Podatki. Inflacja.Bezrobocie. Rola pieniądza w gospodarce.Rola rządu. Prawa i obowiązki przedsiębiorcyi obywatela.Zarządzanie czasem. Wykresy Gantta",
                                              "Nowoczesna makrogospodarka . Gospodarka globalna. Strategie rozwoju światowego.Kryzysy ekonomiczne i kryzysy finansowe.Rozwój gospodarczy i rozwój społeczny.Modele rozwoju ekonomicznego.",
                                              "Ożywianie i schładzanie gospodarki.Gospodarka USA vs gospodarka UE. Strategializbońska. Japonia. Chiny i Indie. Korporacje ifirmy międzynarodowe. Przejęcia wrogie iprzyjazne. Przepływ kapitału i inwestycje FDI.Kryzysy finansowe.Budżetowanie przedsięwzięć i rachunek cash flow.",
                                              "Giełda jako przykład organizacji rynkuinformacji.Planowanie działań i formułowanie strategii.",
                                              "Gospodarka oparta na wiedzy. Firmainnowacyjna. Rynek e-usług. Handelelektroniczny.Logistyka (MRP)",
                                              "Podstawy marketingu. Misja i wizja firmy.Budowa wizerunku. Budowa produktu.Marketing. Analiza business case.",
                                              "Marketing: reklama a zarządzanie rynkiem.Kanały informacyjne. Grupa targetowa.Komunikacja wewnętrzna i komunikacja zewnętrzna. Kampanie marketingowe.Nowoczesny marketing. Marketing w świecieglobalnej wymiany komunikacji.Budowanie kampanii marketingowej",
                                              "Marketing. Logotypy i system identyfikacjiwizualnej. Kampanie społeczne. Firmaodpowiedzialna społecznie. Reagowanie nasytuacje kryzysowe.",
                                              "Budowa i zarządzanie własnegoprzedsiębiorstwa. Formy prowadzeniadziałalności gospodarczej.Symulator ekonomiczny.",
                                              "Podstawy rachunkowości finansowej. Bilansspółki. Wycena firmy. Rachunkowośćzarządcza. Rachunek ekonomiczny firmy.Rachunkowość i cash flow.",
                                              "Umocowanie prawne przedsiębiorcy.Elementy prawa dla menedżerów. Podstawyprawa dla informatyków. Kodeks cywilny.Kodeks spółek handlowych.",
                                              "Ustawa o prawie autorskim. Analiza przypadków prawnych."
                                          ]
                }
}
