{
    "sylabus":  {
                    "uczelnia":  "Polsko-Japonska Akademia Technik Komputerowych Filia w Gdansku",
                    "jednostka":  "Filia w Gdansku",
                    "kierunek":  "INFORMATYKA",
                    "profil":  "praktyczny",
                    "tryb_studiow":  "stacjonarny",
                    "wersja_z_dnia":  "19.02.2026",
                    "nazwa_przedmiotu":  "wychowanie fizyczne",
                    "kod_przedmiotu":  "WF",
                    "rok_studiow":  null,
                    "semestr_studiow":  null,
                    "obligatoryjny":  true,
                    "forma_i_liczba_godzin_zajec":  {
                                                        "wyklady":  null,
                                                        "cwiczenia_lektorat_seminarium":  30,
                                                        "laboratorium_projekt":  null
                                                    },
                    "odpowiedzialny_za_przedmiot":  "",
                    "ects":  0,
                    "godziny":  {
                                    "z_udzialem_prowadzacego_h":  30,
                                    "praca_wlasna_studenta_h":  null,
                                    "calkowita_liczba_godzin_h":  30
                                },
                    "metody_dydaktyczne":  {

                                           },
                    "zaliczenie":  {

                                   },
                    "kryteria_oceny":  [
                                           "Ćwiczenia – praca w grupach,",
                                           "Praca w parach, praca indywidualna",
                                           "Ćwiczenia :",
                                           "Zaliczenie bez oceny",
                                           "Wykład --------------------------------",
                                           "Zaliczenie bez oceny",
                                           "Kryteria oceny",
                                           "Ćwiczenia :",
                                           "-Aktywna obecność na zajęciach, maksymalnie 2 nieusprawiedliwione nieobecności w czasie semestru(zwolnienie lekarskie przedstawione zgodnie z regulaminem).Obecność poświadczona jest w dzienniku zajęć.",
                                           "-Aktywna obecność na zajęciach w wymiarze 45 minut",
                                           "-Zajęcia spoza oferty PJATK poświadczone zaświadczeniem (zgodnie z załącznikiem 1 w regulaminie zaliczenia przedmiotu)",
                                           "-W przypadku długotrwałej choroby lub innych przeciwskazań zdrowotnych możliwe jest zwolnienie lekarskie od specjalisty.",
                                           "Kryteria zaliczenia:",
                                           "-aktywne uczestnictwo w zajęciach",
                                           "-maksymalnie 2 nieobecności(w przypadku zajęć realizowanych przez PJATK)",
                                           "-obecność 100%(w przypadku zajęć spoza oferty PJATK",
                                           "-obecność 100% w przypadku ITN",
                                           "."
                                       ],
                    "przedmioty_wprowadzajace":  [
                                                     {
                                                         "nazwa":  "-----------------------------------------------------------",
                                                         "wymagania":  "------------------------------------------------------------------"
                                                     }
                                                 ],
                    "cel_dydaktyczny":  "kształtowanie zdolności rozpoznawania i oceny własnej sprawności fizycznej i rozwoju fizycznego, zachęcanie do uczestnictwa w sportowych i rekreacyjnych formach aktywności fizycznej, poznanie i umiejętne stosowanie zasad bezpieczeństwa podczas aktywności fizycznej, zrozumienie związku aktywności fizycznej ze zdrowiem oraz kształtowanie umiejętności praktykowania zachowań prozdrowotnych. Zajęcia na basenie, saunie ,siłowni, sali gimnastycznej",
                    "literatura":  {

                                   },
                    "efekty_ksztalcenia":  {
                                               "wiedza":  null,
                                               "umiejetnosci":  [
                                                                    "student jest gotów do nauki o kulturzefizycznej",
                                                                    "krytycznej oceny posiadanej wiedzy i odbieranych treści uznawania znaczenia wiedzy w rozwiązywaniu problemów poznawczych i praktycznych oraz zasięganiaopinii ekspertów w przypadku trudności z samodzielnym rozwiązaniem problemu",
                                                                    "tworzenia i rozwijania wzorów właściwegopostępowania w środowisku pracy i życiapodejmowania inicjatyw, krytycznej oceny siebie oraz zespołów i organizacji, wktórych uczestniczy."
                                                                ],
                                               "kompetencje_spoleczne":  [
                                                                             "Znajomość tematyki: rozwój fizyczny, rozwój sprawności fizycznej, zdrowy styl życia, higiena, hartowanie organizmu.",
                                                                             "Znajomość i przestrzeganie zasad bezpieczeństwa na obiektach sportowych.",
                                                                             "Znaomość regulaminów, przepisów i zasad poznanych dyscyplin sportowych.",
                                                                             "Stosowanie zasady „czystej gry” i sportowego kibicowania."
                                                                         ]
                                           },
                    "tresci_programowe":  [
                                              "Wszechstronny rozwój organizmu, korygowanie wad postawy, przez odpowiedni dobór środków i metod stymulujących i korygujących rozwój i funkcjonowanie układu ruchowego, sercowo-naczyniowego, oddechowego i nerwowego.",
                                              "Rozwój sprawności kondycyjnej i koordynacyjnej oraz dostarczenie studentom wiadomości i umiejętności umożliwiających samokontrolę, samoocenę i samodzielne podejmowanie działań w tym zakresie.",
                                              "Wykształcenie umiejętności ruchowych przydatnych w aktywności zdrowotnej, utylitarnej, rekreacyjnej i sportowej.",
                                              "Wyposażenie studentów w niezbędną wiedzę i umiejętności umożliwiające bezpieczną organizację zajęć ruchowych w różnych warunkach środowiskowych, indywidualnie, w grupie rówieśniczej oraz w rodzinie.",
                                              "Ukształtowanie postawy świadomego i permanentnego uczestnictwa studentów w różnych formach aktywności sportowo-rekreacyjnych w czasie nauki oraz po jej ukończeniu dla zachowania zdrowia fizycznego i psychicznego.",
                                              "Kształtowanie postaw osobowościowych: poczucia własnej wartości, szacunku dla innych osób, zwłaszcza słabszych i mniej sprawnych.",
                                              "Kształtowanie współdziałania w zespole, grupie, akceptacji siebie i innych, kultury kibicowania, stosowania zasady „fair play” w sporcie i w życiu.",
                                              "Szczegółowy program przedmiotu w rozbiciu na tygodnie/bloki tematyczne jest dostępny u prowadzącego zajęcia i koordynatora WF(uzależniony jest od semestru i form realizacji WF)"
                                          ]
                }
}
